class Chelovek:
    nationality = "Ciganin"
    razmer = "Christiano Ronaldo"
    imya = "Azamat Muhamedov"
    profesiya = "hod konem"
    Mesto_Jitelstva = "Shai_lyshai"
    def letat(self):
        pass




"""
1. Узнать, что такое ООП в питоне
2. Что такое наследование + полиморфизм (это не болезнь) + абстракция
3. Для чего вообще нужны классы, как они облегчают нам жизнь
4. Зачем нужен селф в классах?
5. ДОписать внутри класса "Человек" просто какие-то ещё функции (рандомные), как по типу летать
[e6. Сп[росить у гпт - ^^что такое кземпляр класса? {В об[щем, попросить его объхяснить таку, как буйдто для ребёнка
и новичкуа в питоне

"""